Diupth/stm32_LL/Src/Apps/SyncSignalApp.c
#include "SyncSignalApp.h"

#include "SyncSignal.h"
#include "ADCService.h"
#include "ComMgr.h"
#include "stm32h5xx.h"

#ifdef SHOW_SAMPLING_LOG
static uint32_t log_sequence;
static uint32_t last_log_tick;
#endif

void SyncSignalApp_Init(void) {
  SyncSignal_Init();
#ifdef SHOW_SAMPLING_LOG
  last_log_tick = HAL_GetTick();
  log_sequence = 0U;
#endif
}

bool SyncSignalApp_HasFrames(void) {
  return ADCService_HasFrame(1U) && ADCService_HasFrame(2U);
}

bool SyncSignalApp_WaitForFrames(void) {
  /* Nếu cả 2 kênh đều chưa có dữ liệu thì không làm gì */
  if (!ADCService_HasFrame(1U) && !ADCService_HasFrame(2U)) {
    return false;
  }

  /* Khi có ít nhất 1 kênh sẵn sàng, đợi kênh còn lại để đảm bảo đồng bộ 2 kênh.
   * Timeout 5 ms (~3 chu kỳ frame @ 96 kHz / 2048 mẫu) để tránh treo hệ thống
   * khi một kênh ADC bị lỗi DMA hoặc không nhận được ngắt. */
  uint32_t wait_start = HAL_GetTick();
  while (!ADCService_HasFrame(1U) || !ADCService_HasFrame(2U)) {
    ComMgr_Process();
    if ((HAL_GetTick() - wait_start) >= 5U) {
      return false;
    }
  }

  return true;
}

void SyncSignalApp_Process(void) {
#ifdef SHOW_SAMPLING_LOG
  uint32_t now = HAL_GetTick();
  if (now - last_log_tick >= 1000U) {
    last_log_tick = now;
    SyncSignal_SendSamplingLog(log_sequence);
    log_sequence++;
  }
#endif

#ifdef SHOW_ADC_DAC_DEBUG
  SyncSignal_SendADCDACDebug(log_sequence);
#endif
}